In [11]:
import pandas as pd

In [12]:
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:',type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

In [14]:
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
dic1={'Name': ['chulmin','enu','jin','soobean'],'Year':[2001,223,2323,233],'Gender':['Male','Female','Male','Male']}

data_df=pd.DataFrame(dic1)
print(data_df)

data_df=pd.DataFrame(dic1,columns=["Name","Year","Gender","Age"])
print(data_df)
print("#"*30)

      Name  Year  Gender
0  chulmin  2001    Male
1      enu   223  Female
2      jin  2323    Male
3  soobean   233    Male
      Name  Year  Gender  Age
0  chulmin  2001    Male  NaN
1      enu   223  Female  NaN
2      jin  2323    Male  NaN
3  soobean   233    Male  NaN
##############################

In [25]:
data_df=pd.DataFrame(dic1,index=['one','two','three','four'])
print(data_df)
print("#"*30)

          Name  Year  Gender
one    chulmin  2001    Male
two        enu   223  Female
three      jin  2323    Male
four   soobean   233    Male
##############################

In [27]:
print("columns",titanic_df.columns)
print("index:",titanic_df.index)
print("index value:",titanic_df.index.values)

columns Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
index: RangeIndex(start=0, stop=891, step=1)
index value: [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [31]:
series=titanic_df['Name']
print(series.head(3))
print(type(series))

filtered_df=titanic_df[['Name','Age']]# DataFrame에서 Name , Age 열을 따와서 앞에 3개입력
print(filtered_df.head(3))
print(type(filtered_df))

one_col_df=titanic_df[['Name']]
print(one_col_df.head(3))
print(type(one_col_df))

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object
<class 'pandas.core.series.Series'>
                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
<class 'pandas.core.frame.DataFrame'>
                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
<class 'pandas.core.frame.DataFrame'>

In [32]:
print(titanic_df.shape)

(891, 12)

In [33]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [34]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [35]:
value_counts=titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [36]:
titanic_pclass=titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [37]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [39]:
value_counts=titanic_df['Pclass'].value_counts()
print(value_counts)
print(type(value_counts))

3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>

In [42]:
titanic_df.sort_values(by='Pclass',ascending=True)
titanic_df[['Name','Age','Pclass']].sort_values(by=['Pclass','Age'])

                                         Name    Age  Pclass
305            Allison, Master. Hudson Trevor   0.92       1
297              Allison, Miss. Helen Loraine   2.00       1
445                 Dodge, Master. Washington   4.00       1
802       Carter, Master. William Thornton II  11.00       1
435                 Carter, Miss. Lucile Polk  14.00       1
..                                        ...    ...     ...
859                          Razi, Mr. Raihed    NaN       3
863         Sage, Miss. Dorothy Edith "Dolly"    NaN       3
868               van Melkebeke, Mr. Philemon    NaN       3
878                        Laleff, Mr. Kristo    NaN       3
888  Johnston, Miss. Catherine Helen "Carrie"    NaN       3

[891 rows x 3 columns]

In [44]:
import numpy as np

In [47]:
col_name1=['col1']
list1=[1,2,3]
array1=np.array(list1)

print(array1.shape)
df_list1=pd.DataFrame(list1,columns=col_name1)
print(df_list1)

df_array1=pd.DataFrame(array1,columns=col_name1)
print(df_array1)

(3,)
   col1
0     1
1     2
2     3
   col1
0     1
1     2
2     3

In [49]:
col_name2=['col1','col2','col3']
list2=[[1,2,3],[11,12,13]]
array2=np.array(list2)
print(array2.shape)

df_list2=pd.DataFrame(list2,columns=col_name2)
print(df_list2)

df_list3=pd.DataFrame(array2,columns=col_name2)
print(df_list3)

(2, 3)
   col1  col2  col3
0     1     2     3
1    11    12    13
   col1  col2  col3
0     1     2     3
1    11    12    13

In [50]:
dict={'col1':[1,11],'col2':[2,22],'col3':[3,33]}
df_dict=pd.DataFrame(dict)
print(df_dict)

   col1  col2  col3
0     1     2     3
1    11    22    33

In [51]:
array3=df_dict.values
print(array3)

[[ 1  2  3]
 [11 22 33]]

In [53]:
list3=df_dict.values.tolist()#DataFrame을 list로 변환 tolist이요 ㅇ
print(list3)

dict3=df_dict.to_dict('list3') #to_dict를 통하여 DataFrame을 dic으로변환
print(dict3)

[[1, 2, 3], [11, 22, 33]]
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

In [65]:
titanic_df['Age_0']=0
titanic_df.head(3)

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Faimly no
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [66]:
titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Faimly no']=titanic_df['SibSp']+titanic_df['Parch']+1
titanic_df.head(3)

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Faimly no
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [67]:
titanic_df['Age_by_10']=titanic_df['Age_by_10']+100
titanic_df.head(3)

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Faimly no
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [68]:
titanic_drop_df=titanic_df.drop('Age',axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Faimly no
0,1,0,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [69]:
titanic_df.head(3)

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Faimly no
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [72]:
drop_result= titanic_df.drop(['Parch'],axis=1)
titanic_df.head(3)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Faimly no
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [77]:
titanic_df=pd.read_csv('titanic_train.csv')
pd.set_option('display.width',2000)
pd.set_option('display.max_colwidth',13)
print(titanic_df.head(6))

titanic_df.drop([0,1,2],axis=0,inplace=True)   
print(titanic_df.head(6))

   PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch        Ticket     Fare Cabin Embarked
0            1         0       3  Braund, M...    male  22.0      1      0     A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, ...  female  38.0      1      0      PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen...  female  26.0      0      0  STON/O2. ...   7.9250   NaN        S
3            4         1       1  Futrelle,...  female  35.0      1      0        113803  53.1000  C123        S
4            5         0       3  Allen, Mr...    male  35.0      0      0        373450   8.0500   NaN        S
5            6         0       3  Moran, Mr...    male   NaN      0      0        330877   8.4583   NaN        Q
   PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle,...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr...    male   NaN      0      0  330877   8.4583   NaN        Q
6            7         0       1  McCarthy,...    male  54.0      0      0   17463  51.8625   E46        S
7            8         0       3  Palsson, ...    male   2.0      3      1  349909  21.0750   NaN        S
8            9         1       3  Johnson, ...  female  27.0      0      2  347742  11.1333   NaN        S

In [78]:
titanic_df=pd.read_csv('titanic_train.csv')
indexes=titanic_df.index#.index를 통해서 indexes에 idnex를 가져온다. 
print(indexes)
print(indexes.values)

RangeIndex(start=0, stop=891, step=1)
[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [80]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [81]:
indexes[0]=5 #[]를이용하여 임의로 인덱스를 변경할수없다.

TypeError: Index does not support mutable operations

In [82]:
series_fair=titanic_df['Fare']
series_fair.head(5)

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [84]:
print(series_fair.max())
print(series_fair.sum())
print(sum(series_fair))
print((series_fair+3).head(3))

512.3292
28693.9493
28693.949299999967
0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [85]:
titanic_reset_df=titanic_df.reset_index(inplace=true)#DataFrame 및 Series 에 reset_index()메서드를 수행하면 새롭게 인덱스를 할당하며 
#기존 index는 index라는 새로운 column명으로 추가가 된다. 
titanic_reset_df.head(3)

NameError: name 'true' is not defined

In [86]:
titanic_reset_df.shape

NameError: name 'titanic_reset_df' is not defined

In [88]:
titanic_df=pd.read_csv('titanic_train.csv') ##DataFrame의 열 데이터를 가져오는 방법 [] 사용 
print(titanic_df['Pclass'].head(3))
print(titanic_df[['Survived','Pclass']].head(3))

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Survived  Pclass
0         0       3
1         1       1
2         1       3

In [89]:
titanic_df[0:2]#DataFrame의 행데이터르 가져온다 [0:2] 사용

   PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, M...    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, ...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [90]:
titanic_df[titanic_df['Pclass']==3].head(3)#Pclass=3인 데이터를 가져온다.

   PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch        Ticket   Fare Cabin Embarked
0            1         0       3  Braund, M...    male  22.0      1      0     A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen...  female  26.0      0      0  STON/O2. ...  7.925   NaN        S
4            5         0       3  Allen, Mr...    male  35.0      0      0        373450  8.050   NaN        S

In [102]:
data = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one','two','three','four'])
print(data_df)

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [103]:
print(data_df.ix[0,0])
print("\n ix['one', 0]", data_df.ix['one',0])
print("\n ix[3, 'Name']",data_df.ix[3, 'Name'],"\n")
    
print("\n ix[0:2, [0,1]]\n", data_df.ix[0:2, [0,1]])
print("\n ix[0:2, [0:3]]\n", data_df.ix[0:2, 0:3])
print("\n ix[0:3, ['Name', 'Year']]\n", data_df.ix[0:3, ['Name', 'Year']], "\n")
print("\n ix[:] \n", data_df.ix[:])
print("\n ix[:, :] \n", data_df.ix[:, :])

print("\n ix[data_df.Year >= 2014] \n", data_df.ix[data_df.Year >= 2014])

AttributeError: 'DataFrame' object has no attribute 'ix'

In [107]:
data_df_reset=data_df.reset_index()#새로운 0~ index가 생긴다. 
data_df_reset=data_df_reset.rename(columns={'index':'old_index'}) #index->old_index라고 이름을 바꾼다. 
print(data_df_reset)

data_df_reset.index=data_df_reset.index+1
print(data_df_reset)

  old_index      Name  Year  Gender
0       one   Chulmin  2011    Male
1       two  Eunkyung  2016  Female
2     three  Jinwoong  2015    Male
3      four   Soobeom  2015    Male
  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

In [108]:
data_df.head()

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [111]:
data_df.iloc[0,1]#iloc -> just 위치기반 인덱싱 , ix-> 위치,명칭기반 인덱싱제공 , loc- > just명칭기반 인덱싱

2011

data_df

In [120]:
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [121]:
data_df.loc['one','Name']

'Chulmin'

In [126]:
print(data_df.iloc[0:1, 0])

print('명칭기반 loc slicing\n', data_df.loc['one':'two', 'Name'])

one    Chulmin
Name: Name, dtype: object
명칭기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [127]:
print(data_df_reset.loc[1:2 , 'Name'])#1,2 명칭으로 받는다.

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

In [128]:
print(data_df.ix[1:2 , 'Name'])

AttributeError: 'DataFrame' object has no attribute 'ix'

** 불린 인덱싱(Boolean indexing) **
헷갈리는 위치기반, 명칭기반 인덱싱을 사용할 필요없이 조건식을 [ ] 안에 기입하여 간편하게 필터링을 수행

In [130]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, ...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmi...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, ...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der h...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, ...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, ...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, ...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, M...    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, ...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagavey...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, M...    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, M...    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, M...    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell,...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, C...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mr...  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson,...    male  74.0      0      0       347060    7.7750          NaN        S

In [132]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)

            Name   Age
33  Wheadon, ...  66.0
54  Ostby, Mr...  65.0
96  Goldschmi...  71.0

In [133]:
titanic_df[['Name','Age']][titanic_df['Age'>60].head(3)

SyntaxError: unexpected EOF while parsing (<ipython-input-133-358eb87c3963>, line 1)

In [135]:
titanic_df[ (titanic_df['Age'] > 60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]
#논리 연산자로 결합된 조건식도 불린 인덱싱으로 적용 가능합니다.

     PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, ...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mr...  female  62.0      0      0  113572  80.0000   B28      NaN

In [136]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[ cond1 & cond2 & cond3]
#조건식은 변수로도 할당 가능합니다. 복잡한 조건식은 변수로 할당하여 가득성을 향상 할 수 있습니다.

     PassengerId  Survived  Pclass          Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, ...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mr...  female  62.0      0      0  113572  80.0000   B28      NaN

In [137]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [139]:
titanic_df[['Age', 'Fare']].mean(axis=1)

0      14.62500
1      54.64165
2      16.96250
3      44.05000
4      21.52500
         ...
886    20.00000
887    24.50000
888    23.45000
889    28.00000
890    19.87500
Length: 891, dtype: float64

In [140]:
titanic_df[['Age', 'Fare']].sum(axis=0)

Age     21205.1700
Fare    28693.9493
dtype: float64

In [141]:
titanic_df[['Age', 'Fare']].count()

Age     714
Fare    891
dtype: int64

** Aggregation 함수 ** Group by

In [152]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby)) 
print(titanic_groupby)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000023EBD444BC8>

In [ ]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

In [ ]:
titanic_groupby = titanic_df.groupby(by='Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

In [ ]:
titanic_df[['Pclass','PassengerId', 'Survived']].groupby('Pclass').count()

In [ ]:
titanic_df.groupby('Pclass')['Pclass'].count()
titanic_df['Pclass'].value_counts()

In [ ]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

In [ ]:
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

파이썬 lambda 식

In [142]:
def get_square(a):
    return a**2

print(get_square(3))

9

In [143]:
lamda_square = lambda x : x**2
print(lamda_square(3))

9

In [144]:
a=[1,2,3]
squares=map(lambda x :x**2,a)
list(squares)

[1, 4, 9]

In [146]:
titanic_df['Name_len']=titanic_df['Name'].apply(lambda x: len(x))
titanic_df[['Name','Name_len']].head(3)

           Name  Name_len
0  Braund, M...        23
1  Cumings, ...        51
2  Heikkinen...        22

In [147]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x<=15 else 'Adult') #[]->  열 추가한다. 
titanic_df[['Age','Child_Adult']].head(10)# [[]]  열확인한다

    Age Child_Adult
0  22.0       Adult
1  38.0       Adult
2  26.0       Adult
3  35.0       Adult
4  35.0       Adult
5   NaN       Adult
6  54.0       Adult
7   2.0       Child
8  27.0       Adult
9  14.0       Child

In [149]:
titanic_df['Age_cat']=titanic_df['Age'].apply(lambda x : 'Child' if x<= 15 else('Adult' if x<= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts() 

# Age cat열을  age열에서 따와서 새로 만들고 value_counts를 사용한다.

Adult      609
Elderly    199
Child       83
Name: Age_cat, dtype: int64

In [151]:
def get_category(age):## age에 따라 cat을 나눈다. 
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x)) #age열에 위에서 만든 함수를 적용하여  age cat 열을 새로만듬
titanic_df[['Age','Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult